LeoHJX/nrf5sdkExamples/nus_throughput_test/ble_app_uart/main.c
#define SCHED_MAX_EVENT_DATA_SIZE APP_TIMER_SCHED_EVENT_DATA_SIZE /**< Maximum size of scheduler events. */
#ifdef SVCALL_AS_NORMAL_FUNCTION
#define SCHED_QUEUE_SIZE 40 /**< Maximum number of events in the scheduler queue. More is needed in case of Serialization. */
#else
#define SCHED_QUEUE_SIZE 20 /**< Maximum number of events in the scheduler queue. */
#endif

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

typedef enum {
        APP_STATE_IDLE = 0,
        APP_STATE_ADVERTISING,
        APP_STATE_CONNECTED,
        APP_STATE_DISCONNECTED
} app_state_t;

typedef enum {
        APP_PHY_1M = 0,
        APP_PHY_2M,
        APP_PHY_MULTI,
        APP_PHY_CODED,
        APP_PHY_LIST_END
} app_phy_t;

typedef struct {
        app_state_t app_state;
        app_phy_t phy;
} app_display_content_t;

app_display_content_t m_application_state = {0};

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
        .adv_data =
        {
                .p_data = m_enc_advdata,
                .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
        },
        .scan_rsp_data =
        {
                .p_data = m_enc_scan_response_data,
                .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

        }
};

static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
        {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

static bool m_advertising_is_start = false;
static bool m_data_is_sending      = false;

static uint32_t m_data_sending_counter = 0;

static uint8_t m_test_buffer [] =
{
        0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09,
        10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
        20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
        30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 101, 102, 103, 104, 105, 106, 107, 108, 109,
        110, 111, 112, 113, 114, 115, 116, 117, 118, 119,
        120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
        130, 131, 132, 133, 134, 135, 136, 137, 138, 139,
        140, 141, 142, 143, 144, 145, 146, 147, 148, 149,
        150, 151, 152, 153, 154, 155, 156, 157, 158, 159,
        160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
        170, 171, 172, 173, 174, 175, 176, 177, 178, 179,
        180, 181, 182, 183, 184, 185, 186, 187, 188, 189,
        190, 191, 192, 193, 194, 195, 196, 197, 198, 199,
        200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
        210, 211, 212, 213, 214, 215, 216, 217, 218, 219,
        220, 221, 222, 223, 224, 225, 226, 227, 228, 229,
        230, 231, 232, 233, 234, 235, 236, 237, 238, 239,
        240, 241, 242, 243, 244
};

static throughput_measure_init_t m_throughput_measure_init;
static throughput_measure_config_t m_throughput_measure_config;
static throughput_measure_data_receive_t m_throughput_measure_receive_data;
static throughput_measure_data_send_t m_throughput_measure_send_data;

static void throughput_measure_evt_handler(throughput_measure_evt_t * p_throughput_measure_evt)
{
        switch(p_throughput_measure_evt->evt_type)
        {
        case eTHROUGHPUT_INIT_DONE:
                break;
        case eTHROUGHPUT_LIVE:
                break;
        case eTHROUGHPUT_RESET:
                break;
        case eTHROUGHPUT_START:
                NRF_LOG_INFO("eTHROUGHPUT_START");
                break;
        case eTHROUGHPUT_STOP:
                break;
        case eTHROUGHPUT_THRESHOLD:
                break;
        case eTHROUGPPUT_SUMMARY:
                break;
        default:
                break;
        }
}

static uint32_t throughput_measure_setup(void)
{
        m_throughput_measure_init.evt_handler  = throughput_measure_evt_handler;
        m_throughput_measure_config.payload_length  = m_ble_nus_max_data_len;
        m_throughput_measure_config.live_timer_interval = 1000; // one seconds
        m_throughput_measure_config.receive_data_threshold = 0x100000; // 1024KB
        m_throughput_measure_config.send_data_threshold = 0x100000; // 64KB

        memcpy(&m_throughput_measure_init.config, &m_throughput_measure_config, sizeof(m_throughput_measure_config));
        throughput_measure_init(&m_throughput_measure_init);
}
static uint32_t data_transmit_handler(uint8_t *send_data, uint16_t len)
{
        //if (!m_data_is_sending)
        uint32_t err_code = NRF_SUCCESS;
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
                uint16_t length = len;
                do
                {
                        // Send data back to the peripheral.
                        uint32_t err_code = ble_nus_data_send(&m_nus, send_data, &length, m_conn_handle);
                        if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY) && (err_code != NRF_ERROR_RESOURCES))
                        {
                                NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x. ", err_code);
                                APP_ERROR_CHECK(err_code);
                        }
                        if (err_code == NRF_ERROR_RESOURCES)
                                break;

