LeoHJX/nrf5sdkExamples/nus_throughput_test/ble_app_uart/main.c
                        throughput_measure_send_update(length);
                } while (err_code != NRF_ERROR_RESOURCES);
                m_data_is_sending = true;
                //NRF_LOG_INFO("counter_loop = %x", counter_loop);
        }
        return err_code;
}

static uint32_t data_received_handler(uint8_t *receive_data, uint16_t len)
{

}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/****************************************************************/
static void Get_Connect_MAC_Address(ble_gap_addr_t *gap_address)
{
        NRF_LOG_INFO("Connected to Central address to: %02X:%02X:%02X:%02X:%02X:%02X",
                     gap_address->addr[5],
                     gap_address->addr[4],
                     gap_address->addr[3],
                     gap_address->addr[2],
                     gap_address->addr[1],
                     gap_address->addr[0]);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
        uint32_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *) DEVICE_NAME,
                                              strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for changing the tx power.
 */
static void tx_power_advertising_set(void)
{
        ret_code_t err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, TX_POWER_LEVEL);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for changing the tx power.
 */
static void tx_power_connected_set(void)
{
        ret_code_t err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, TX_POWER_LEVEL);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static uint32_t receive_packet_count = 0;
static uint32_t receive_packet_bytes = 0;

static void nus_data_handler(ble_nus_evt_t * p_evt)
{

        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;
                receive_packet_bytes += p_evt->params.rx_data.length;
                receive_packet_count++;

                //NRF_LOG_INFO("Received data %08x, %08x", receive_packet_bytes(), receive_packet_count++);
                NRF_LOG_INFO("Received data %08x, %08x", app_timer_cnt_get(), receive_packet_bytes);
                //NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
//                for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
//                {
//                        do
//                        {
//                                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
//                                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
//                                {
//                                        NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
//                                        APP_ERROR_CHECK(err_code);
//                                }
//                        } while (err_code == NRF_ERROR_BUSY);
//                }
//                if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
//                {
//                        while (app_uart_put('\n') == NRF_ERROR_BUSY);
//                }
        }
        else if (p_evt->type == BLE_NUS_EVT_TX_RDY) //,       /**< Service is ready to accept new data to be transmitted. */
        {
        }
        else if (p_evt->type == BLE_NUS_EVT_COMM_STARTED) //,       /**< Notification has been enabled. */
        {
                // After BLE Subscription enable (CCCD enable)
        }
        else if (p_evt->type == BLE_NUS_EVT_COMM_STOPPED) //,       /**< /**< Notification has been disabled. */. */
        {

        }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        uint32_t err_code;
        ble_nus_init_t nus_init;
        nrf_ble_qwr_init_t qwr_init = {0};

