LeoHJX/nrf5sdkExamples/nus_throughput_test/ble_app_uart/main.c
        //ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}};

        // Build and set advertising data.
        memset(&advdata, 0, sizeof(advdata));
        advdata.name_type          = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = true;
        advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;


        memset(&srdata, 0, sizeof(srdata));
        srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        srdata.uuids_complete.p_uuids  = m_adv_uuids;

        err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
        APP_ERROR_CHECK(err_code);

        err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
        APP_ERROR_CHECK(err_code);

        ble_gap_adv_params_t adv_params;

        // Set advertising parameters.
        memset(&adv_params, 0, sizeof(adv_params));

        NRF_LOG_INFO("%s: m_application_state = %d", __func__, m_application_state.phy);

        // Set advertising parameters.
        memset(&adv_params, 0, sizeof(adv_params));
        {
                adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
                adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;
                adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
        }
        adv_params.duration = APP_ADV_DURATION;
        adv_params.p_peer_addr     = NULL;
        adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
        adv_params.interval        = APP_ADV_INTERVAL;

        err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
        APP_ERROR_CHECK(err_code);

        tx_power_advertising_set();

}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
        ret_code_t err_code;

        switch (pin_no)
        {
        case START_DATA_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        if (!m_data_is_sending)
                        {
                                m_data_sending_counter = 0;
                                uint16_t length =sizeof(m_test_buffer);
                                throughput_measure_reset_send_count();
                                throughput_measure_live_timer_start();
                                data_transmit_handler(m_test_buffer,length);
                                m_data_is_sending = true;
                        }
                }
                break;
        case STOP_DATA_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        m_data_is_sending = false;
                        throughput_measure_live_timer_stop();
                        throughput_measure_reset_receive_count();
                }
                break;

        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}



/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {START_DATA_BUTTON, false, BUTTON_PULL, button_event_handler},
                {STOP_DATA_BUTTON, false, BUTTON_PULL, button_event_handler},
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);


}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
#define FPU_EXCEPTION_MASK 0x0000009F


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
  #if defined (NRF52832_XXAA) || defined (NRF52840_XXAA)
        __set_FPSCR(__get_FPSCR()  & ~(FPU_EXCEPTION_MASK));
        (void) __get_FPSCR();
        NVIC_ClearPendingIRQ(FPU_IRQn);
  #endif
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}




/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;

        // Initialize.
        //uart_init();
        log_init();

        NRF_LOG_INFO("\n\nReset reason = %x\n\n", NRF_POWER->RESETREAS);

        timers_init();

        buttons_init();
        bsp_board_init(BSP_INIT_LEDS);

        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        NRF_LOG_INFO("BLE Throughput Demo on BLE 2Mbps (Peripheral)");
        advertising_start();

        m_application_state.phy = APP_PHY_2M;
        m_data_is_sending = false;

        conn_evt_len_ext_set(true);

        throughput_measure_setup();

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
